<script setup>
import TagToggle from "../toggles/TagToggle.vue";
import NewsCard from "../cards/NewsCard.vue";

import { ref, reactive } from 'vue';

const newsList = reactive([
  {
    "id": 1,
    "title": "Ароматный латте: секреты идеальной пенки",
    "text": [
      "Настоящий латте отличается тонким балансом эспрессо и молока с пышной кремообразной пенкой. Если ваша цель – освоить искусство создания безупречной латте-арты, начните с выбора правильного молока. Важно помнить, что молоко низкой жирности даёт менее устойчивую пену, тогда как высокая жирность обеспечивает плотность и устойчивость. Идеально подойдёт пастеризованное коровье молоко средней жирности (около 3%). Тёплое молоко взбивайте постепенно, создавая мелкие пузырьки, и завершайте процесс, аккуратно распределяя пену поверх эспрессо."
    ],
    "author": "Ирина Волкова",
    "date": "07.11.2025",
    "tag": "кофе"
  },
  {
    "id": 2,
    "title": "Зелёный чай против чёрного: Какой полезнее?",
    "text": [
      "Выбор между зеленым и черным чаем зачастую определяется предпочтениями каждого человека. Зеленый чай богат катехинами и полифенолами, которые помогают бороться с воспалением и снижают риск сердечно-сосудистых заболеваний. Черный чай тоже обладает сильными антиоксидантными свойствами благодаря содержанию флавоноидов и дубильных кислот. Однако черный чай сильнее влияет на нервную систему и способен повышать уровень кортизола, особенно если пить его на голодный желудок. Оба сорта хороши, но важно учитывать индивидуальные особенности организма."
    ],
    "author": "Максим Семенов",
    "date": "09.11.2025",
    "tag": "чай"
  },
  {
    "id": 3,
    "title": "Польза корицы: Лучший друг иммунитета",
    "text": [
      "Корицу издавна ценят за способность улучшать пищеварение и поддерживать иммунную систему. Эта уникальная специя стимулирует кровообращение, укрепляет стенки сосудов и снижает воспалительные процессы. Её использование рекомендуется даже диабетикам, поскольку корица способна снижать уровень глюкозы в крови. Регулярное умеренное потребление корицы способствует снижению риска сердечных заболеваний и улучшению общего самочувствия."
    ],
    "author": "Наталья Андреева",
    "date": "11.11.2025",
    "tag": "специи"
  },
  {
    "id": 4,
    "title": "Гречка с грибами: идеальное сочетание белков и углеводов",
    "text": [
      "Гречка – ценный источник сложных углеводов, железа и магния. Грибы содержат витамины группы B, D и микроэлементы, полезные для нервной системы и кожи. Это превосходное сочетание питательных элементов прекрасно подходит для вегетарианцев и тех, кто хочет обогатить своё питание белком растительного происхождения. Такой простой и полезный гарнир обеспечит вас энергией надолго."
    ],
    "author": "Светлана Соколова",
    "date": "13.11.2025",
    "tag": "полезные продукты"
  },
  {
    "id": 5,
    "title": "Популярные добавки в кофе: Топ-5 лучших ингредиентов",
    "text": [
      "Иногда хочется попробовать нечто особенное, и кофе открывает массу возможностей для экспериментов. Например, попробуйте добавлять ваниль, корицу, мускатный орех или молотые орехи. Отличным выбором будет миндальное масло или кокосовая стружка. Главное правило – экспериментируйте осторожно, начиная с небольших порций добавок, чтобы оценить реакцию своего организма."
    ],
    "author": "Алексей Сидоров",
    "date": "15.11.2025",
    "tag": "кофе"
  },
  {
    "id": 6,
    "title": "Пряности для похудения: Специи ускоряют метаболизм",
    "text": [
      "Регулярно употребляя специи, вы можете заметно повысить эффективность диетического режима. Куркума, красный перец, чеснок и имбирь обладают способностью стимулировать выработку тепла организмом и способствовать быстрому расщеплению жиров. Включив их в повседневный рацион, вы заметите положительные изменения быстрее, чем ожидаете."
    ],
    "author": "Дарья Морозова",
    "date": "17.11.2025",
    "tag": "специи"
  },
  {
    "id": 7,
    "title": "Чёрный шоколад: Источник антиоксидантов и хорошего настроения",
    "text": [
      "Темный шоколад с высоким содержанием какао (от 70%) оказывает положительное влияние на организм. Антиоксиданты укрепляют сердце и сосуды, предотвращают развитие хронических болезней и улучшают настроение. Чтобы насладиться всеми преимуществами шоколада, выбирайте высококачественный продукт без добавления большого количества сахара и растительных масел."
    ],
    "author": "Михаил Новиков",
    "date": "19.11.2025",
    "tag": "полезные продукты"
  },
  {
    "id": 8,
    "title": "Лучший способ хранения кофе: Как сохранить свежесть зерна",
    "text": [
      "Чтобы ваш кофе оставался ароматным и сохранял весь букет вкусов, следите за условиями хранения. Используйте герметичные контейнеры, храните зерно в прохладном тёмном месте вдали от света и влаги. Оптимальной температурой считается около +18°C. Покупайте небольшие порции кофе, чтобы минимизировать контакт с воздухом и сохранять свежесть продукта дольше."
    ],
    "author": "Оксана Кузнецова",
    "date": "21.11.2025",
    "tag": "кофе"
  },
  {
    "id": 9,
    "title": "Белый чай: Уникальность вкуса и польза для организма",
    "text": [
      "Этот редкий вид чая практически не подвергается ферментации, сохраняя всю палитру природных соединений и эфирных масел. Белый чай имеет лёгкую кислинку и травянистый оттенок, обеспечивая высокую концентрацию антиоксидантов. По сравнению с другими видами чая белый наиболее бережно воздействует на желудочно-кишечный тракт и отлично утоляет жажду."
    ],
    "author": "Виктория Алексеева",
    "date": "23.11.2025",
    "tag": "чай"
  },
  {
    "id": 10,
    "title": "Любимая приправа шеф-поваров: Тайны итальянской кухни",
    "text": [
      "Базилик – одна из любимых специй итальянского народа. Эта трава идеально сочетается с помидорами, сыром моцарелла и оливковым маслом, образуя знаменитую комбинацию Caprese. Базилик также используется в пицце и соусах для пасты, обогащая блюда уникальным сладковатым оттенком и свежестью."
    ],
    "author": "Андрей Фёдоров",
    "date": "25.11.2025",
    "tag": "специи"
  },
  {
    "id": 11,
    "title": "Три рецепта смузи с добавлением какао",
    "text": [
      "Кто сказал, что смузи обязательно должен быть овощным или ягодным? Смузи с добавлением натурального какао порошка позволит насладиться полезным напитком, богатым магнием и железом. Вот три простых рецепта: классический с бананами, морковный смузи с апельсиновым соком и греческий йогурт с какао и мёдом."
    ],
    "author": "Юлия Васильева",
    "date": "27.11.2025",
    "tag": "полезные продукты"
  },
  {
    "id": 12,
    "title": "Альтернативные методы заварки чая: Экспериментируем с классическими рецептами",
    "text": [
      "Классический метод заваривания подразумевает кипячение воды и настаивание листьев чая. Но почему бы не попробовать альтернативные варианты? Вы можете использовать холодный настой, приготовление на молоке или применение фруктов и цитрусовых для усиления вкуса. Эти методы позволят раскрыть совершенно новые грани вкуса любимого напитка."
    ],
    "author": "Антон Борисов",
    "date": "29.11.2025",
    "tag": "чай"
  },
  {
    "id": 13,
    "title": "Десять рецептов домашнего лимонада с травами и фруктами",
    "text": [
      "Домашний лимонад – прекрасный способ насытить организм витаминами и поднять настроение. Предлагаем десять идей, как сделать лимонад ярче и интереснее: мятный лимонад с лаймом, огуречно-малиновый лимонад, розмариновый лимонад с клубникой и многие другие вариации."
    ],
    "author": "Анна Денисова",
    "date": "01.12.2025",
    "tag": "полезные продукты"
  },
  {
    "id": 14,
    "title": "Семь полезных свойств мёда: Полезный десерт на каждый день",
    "text": [
      "Натуральный мёд – отличное дополнение к любому блюду. Помимо прекрасного вкуса, мёд богат витамином C, кальцием и фосфором. Ученые доказали, что регулярное употребление небольшого количества мёда благотворно влияет на состояние иммунной системы, защищает клетки от повреждений свободными радикалами и поддерживает здоровье полости рта."
    ],
    "author": "Владислав Белов",
    "date": "03.12.2025",
    "tag": "полезные продукты"
  },
  {
    "id": 15,
    "title": "Свежий взгляд на обжарку кофе: Рекомендации от профессионалов",
    "text": [
      "Для настоящего гурмана кофе начинается с правильного обжаривания зёрен. Специалисты рекомендуют покупать свежеобжаренные бобы и хранить их не более месяца после покупки. Каждый тип обжарки придаёт кофе особый вкус: светлая обжарка раскрывает фруктово-цветочные ноты, средняя подчёркивает карамельные оттенки, а тёмная – добавляет горчинку и глубину вкусу."
    ],
    "author": "Станислав Захаров",
    "date": "05.12.2025",
    "tag": "кофе"
  },
  {
    "id": 16,
    "title": "Напиток долголетия: Ягоды асаи в рационе",
    "text": [
      "Ягоды асаи – природный суперфуд родом из Бразилии. Они содержат антиоксиданты, способные защитить клетки организма от повреждений и замедлить старение клеток. Высокое содержание витамина E и омега-кислот делают их отличным источником энергии и поддерживают работу сердца и сосудов."
    ],
    "author": "Екатерина Козлова",
    "date": "07.12.2025",
    "tag": "полезные продукты"
  },
  {
    "id": 17,
    "title": "Столовое вино: Польза или вред?",
    "text": [
      "Красное сухое вино в разумных количествах действительно может приносить пользу здоровью. Оно содержит ресвератрол, мощный антиоксидант, защищающий сердечно-сосудистую систему. Умеренное количество вина способно снизить риск развития диабета второго типа и предотвратить преждевременное старение клеток. Тем не менее злоупотреблять вином категорически нельзя."
    ],
    "author": "Роман Яковлев",
    "date": "09.12.2025",
    "tag": "полезные продукты"
  },
  {
    "id": 18,
    "title": "Цветочный чай: Изюминка весенних вечеров",
    "text": [
      "Цветочные чаи создают особую атмосферу спокойствия и гармонии. Розовый, жасминовый, ромашковый – разнообразие оттенков позволяет каждому найти свой идеальный вариант. Цветочные чаи отличаются низким уровнем кофеина и мягким успокаивающим эффектом, помогающим расслабиться после напряжённого дня."
    ],
    "author": "Алёна Громова",
    "date": "11.12.2025",
    "tag": "чай"
  },
  {
    "id": 19,
    "title": "Приготовление имбирного чая: Тепло и уют холодными вечерами",
    "text": [
      "Теплый и терпкий имбирный чай прекрасно согревает зимой и осенью. Этот напиток известен своей пользой для пищеварения и укрепления иммунитета. Добавляйте лимон, мёд или мелиссу для улучшения вкуса и увеличения пользы. Готовится имбирный чай быстро и просто, позволяя насладиться теплом и комфортом."
    ],
    "author": "Кирилл Орлов",
    "date": "13.12.2025",
    "tag": "чай"
  },
  {
    "id": 20,
    "title": "Использование кардамона в кулинарии: Необычные идеи для вдохновения",
    "text": [
      "Кардамон традиционно ассоциируется с индийской кухней, но эта специя находит свое место и в европейских блюдах. Кардамон добавляют в выпечку, напитки и мясные блюда, придавая пище изысканный восточный шарм. Его тонкий запах и слегка сладкий привкус придают удивительную гармонию и утонченность любым блюдам."
    ],
    "author": "Нина Романова",
    "date": "15.12.2025",
    "tag": "специи"
  },
    {
    "id": 21,
    "title": "Новый сезон кофе из Эфиопии: Новый вкус и впечатления",
    "text": [
      "Каждый год любители кофе ждут нового урожая эфиопского кофе. Обзор свежего сезона откроет для вас яркие вкусы свежих плодов и подарит неповторимое удовольствие от дегустации элитных сортов арабики."
    ],
    "author": "Иван Иванов",
    "date": "17.12.2025",
    "tag": "кофе"
  },
  {
    "id": 22,
    "title": "Сенсационный зелёный чай Гэнмайтя: Японский секрет здоровья",
    "text": [
      "Зелёный чай Гэнмайтя, известный также как «рисовый чай», сочетает мягкость зелёного чая и приятное ощущение прожаренного риса. Богатый витаминами и аминокислотами, он мягко тонизирует и наполняет позитивом."
    ],
    "author": "Анна Петрова",
    "date": "19.12.2025",
    "tag": "чай"
  },
  {
    "id": 23,
    "title": "От колдовства и магии до современных ресторанов: История паприки",
    "text": [
      "История паприки уходит далеко в прошлое. Сначала её использовали в ритуалах и народной медицине, а позже испанские мореплаватели привезли паприку в Европу. Сегодня эта ярко-красная специя стала важной составляющей многих национальных кухонь мира."
    ],
    "author": "Николай Дмитриев",
    "date": "21.12.2025",
    "tag": "специи"
  },
  {
    "id": 24,
    "title": "Макроэлементы и микроэлементы в продуктах питания: Ваш путеводитель по здоровой диете",
    "text": [
      "Наш организм нуждается в макро- и микроэлементах ежедневно. В статье разобраны основные пищевые источники кальция, калия, фосфора, железа и других важных компонентов, необходимых для поддержания оптимального уровня здоровья."
    ],
    "author": "Людмила Гордеева",
    "date": "23.12.2025",
    "tag": "полезные продукты"
  },
  {
    "id": 25,
    "title": "Пять способов усилить вкус кофе без сахара",
    "text": [
      "Простые советы помогут придать кофе выразительный вкус, не прибегая к искусственным подсластителям. Натуральные специи, травы и сиропы сделают вашу чашку настоящей радостью для ваших вкусовых рецепторов."
    ],
    "author": "Елена Семёнова",
    "date": "25.12.2025",
    "tag": "кофе"
  },
  {
    "id": 26,
    "title": "Учимся читать этикетки чая: Секреты производителей раскрыты!",
    "text": [
      "Часто возникает вопрос: почему два разных вида чая могут отличаться по цене? Статья подробно объясняет разницу между натуральным листовым чаем и пакетированным продуктом, показывая истинную ценность качественного сырья."
    ],
    "author": "Артём Белоусов",
    "date": "27.12.2025",
    "tag": "чай"
  },
  {
    "id": 27,
    "title": "Семь секретов эффективного управления стрессом с помощью специй",
    "text": [
      "Современному человеку трудно избежать стресса, но некоторые специи помогают уменьшить его воздействие. Научившись грамотно применять натуральные средства, вы сможете ощутимо облегчить жизнь своему телу и мозгу."
    ],
    "author": "Владимир Павлов",
    "date": "29.12.2025",
    "tag": "специи"
  },
  {
    "id": 28,
    "title": "Полезные привычки завтрака: Начните день с правильного старта",
    "text": [
      "Первый приём пищи задаёт тон всему дню. В статье рассматриваются ключевые принципы составления сбалансированного завтрака, наполненного необходимыми питательными веществами и обеспечивающего стабильную энергию на протяжении всего утра."
    ],
    "author": "Татьяна Ильина",
    "date": "31.12.2025",
    "tag": "полезные продукты"
  },
  {
    "id": 29,
    "title": "Этикетка кофе «Fair Trade»: Почему стоит обратить внимание?",
    "text": [
      "Покупая кофе с маркировкой Fair Trade («Справедливая торговля»), вы делаете вклад в улучшение условий труда фермеров и экологическое благополучие планеты. Статья рассказывает, почему стоит поддержать этичное производство кофе."
    ],
    "author": "Алексей Лавров",
    "date": "02.01.2026",
    "tag": "кофе"
  },
  {
    "id": 30,
    "title": "Белый чай Дахонгпао: Чашка драгоценности из Китая",
    "text": [
      "Белый чай, выращиваемый в провинции Фуцзянь, славится особым способом обработки, позволяющим максимально сохранить природные элементы растения. Читайте подробнее о том, как создать правильную обстановку для наслаждения этим благородным напитком."
    ],
    "author": "Анжела Соловьева",
    "date": "04.01.2026",
    "tag": "чай"
  },
  {
    "id": 31,
    "title": "Гастрономические приключения: Пряности Ближнего Востока",
    "text": [
      "Кухня стран Ближнего Востока характеризуется яркими ароматами и смелым сочетанием специй. Описаны уникальные комбинации пряностей, которые используются в традиционных блюдах Турции, Ирана и Ливана."
    ],
    "author": "Борис Васильев",
    "date": "06.01.2026",
    "tag": "специи"
  },
  {
    "id": 32,
    "title": "Преимущества семян чиа: Незаменимы в здоровом питании",
    "text": [
      "Эти крошечные семена обладают мощными лечебными свойствами и невероятной пищевой ценностью. Они становятся основой множества здоровых закусок и напитков, снабжающих организм важными элементами и повышающими энергетический потенциал."
    ],
    "author": "Тамара Казакова",
    "date": "08.01.2026",
    "tag": "полезные продукты"
  },
  {
    "id": 33,
    "title": "Четырёхступенчатая система оценки кофе: Пошаговая инструкция для начинающих",
    "text": [
      "Процесс оценивания кофе требует определённых знаний и опыта. Статья описывает четыре ключевых этапа дегустации, позволяющие новичкам уверенно ориентироваться в мире кофе и находить подходящий сорт."
    ],
    "author": "Денис Панфилов",
    "date": "10.01.2026",
    "tag": "кофе"
  },
  {
    "id": 34,
    "title": "Освежающие летние чаи: Легкость и прохлада в жаркое лето",
    "text": [
      "Наступило лето, и пришло время насладиться охлаждёнными чаями. Представляем коллекцию лёгких летних вариантов, которые подарят ощущение свежести и расслабления."
    ],
    "author": "Игорь Макаров",
    "date": "12.01.2026",
    "tag": "чай"
  },
  {
    "id": 35,
    "title": "Самодельные специи: Всё, что нужно знать о домашней заготовке",
    "text": [
      "Собственноручно сделанные специи гораздо ароматнее покупных аналогов. Здесь собраны лучшие советы по созданию собственных смесей, которые украсят ваши любимые блюда."
    ],
    "author": "Ольга Тихонова",
    "date": "14.01.2026",
    "tag": "специи"
  },
  {
    "id": 36,
    "title": "Комбуча: Полезный ферментированный напиток",
    "text": [
      "Комбуча — традиционный напиток, созданный путём естественного брожения чая. Он известен положительным влиянием на микрофлору кишечника и укрепление иммунитета. Откройте мир комбучи вместе с нашими рекомендациями."
    ],
    "author": "Сергей Николаев",
    "date": "16.01.2026",
    "tag": "полезные продукты"
  },
  {
    "id": 37,
    "title": "Особенности мокко: Итальянская классика и современный подход",
    "text": [
      "Мокко — один из самых популярных видов кофе, отличающийся густотой и интенсивностью вкуса. Узнайте, как добиться идеальной консистенции и идеального баланса между крепостью и сладостью."
    ],
    "author": "Анна Корнилова",
    "date": "18.01.2026",
    "tag": "кофе"
  },
  {
    "id": 38,
    "title": "Травяные чаи и отвары: Целебные настои природы",
    "text": [
      "Наслаждение любимым травяным чаем – настоящее блаженство. Природные компоненты предлагают много преимуществ для здоровья, будь то снижение стресса или повышение иммунитета."
    ],
    "author": "Дмитрий Попов",
    "date": "20.01.2026",
    "tag": "чай"
  },
  {
    "id": 39,
    "title": "Тайны розмарина: Чудодейственное растение Средиземноморья",
    "text": [
      "Розмарин — это маленькая звезда средиземноморской кухни. Благодаря своему сильному аромату и целебным свойствам, розмарин широко применяется в кулинарии и фитотерапии."
    ],
    "author": "Василий Левченко",
    "date": "22.01.2026",
    "tag": "специи"
  },
  {
    "id": 40,
    "title": "Магия гранатового сока: Безграничные возможности оздоровления",
    "text": [
      "Гранатовый сок – невероятно богатый источник витаминов и микроэлементов. Ежедневное употребление этого напитка положительно скажется на общем состоянии здоровья и повысит жизненный тонус."
    ],
    "author": "Елизавета Жукова",
    "date": "24.01.2026",
    "tag": "полезные продукты"
  }
])

const tagValue = ref("");

const newsCount = ref(3);

const tagItems = reactive(["кофе", "чай", "специи", "полезные продукты"]);
</script>

<template>
  <div class="news-block">

    <div class="news-block__top">
      <h2 class="news-block__title">Новости:</h2>

      <tag-toggle
        class="news-block__toggle"
        :toggleName="'tag'"
        :initialValues="tagItems"
        @toggle-value="tagValue = $event"
      ></tag-toggle>
    </div>
      
    <ul class="news-block__list">
      <li class="news-block__item"
      v-for="newItem in newsList.filter(newItem => !tagValue.length || (newItem.tag == tagValue)).filter((el, ind) => ind < Number(newsCount))"
      :key="newItem.id">
        <news-card :newsItem="newItem"></news-card>
      </li>
    </ul>

    <button
      class="news__button btn--white-xl"
      type="button"
      :disabled="newsCount == newsList.filter(newItem => !tagValue.length || (newItem.tag == tagValue)).length"
      @click="newsCount <= newsList.filter(newItem => !tagValue.length || (newItem.tag == tagValue)).length - 3 ? newsCount += 3 : newsCount = newsList.filter(newItem => !tagValue.length || (newItem.tag == tagValue)).length"
    >
      Показать ещё
    </button>
  </div>
</template>

<style lang="scss" scoped>

.btn--white-xl {
  display: flex;
  align-items: center;
  justify-content: center;
  font-family: $ff-gilroy, sans-serif;
  border-radius: 5px;
  margin: 0;
  cursor: pointer;
  user-select: none;
  color: $color-black;
  background-color: $color-white;
  border-width: 1px;
  border-style: solid;
  border-color: $color-platinum;
  padding: 25px 23px 21px;
  font-size: 20px;
  line-height: 24px;
  font-weight: 500;
  border-radius: 10px;
  text-align: center;

  @include vp-laptop {
    border-width: 0.71px;
    padding: 18px 16px 14px;
    font-size: 14px;
    line-height: 17px;
    border-radius: 7px;
  }

  @include vp-tablet {
    border-width: 1px;
    padding: 21px 21px 14px;
    font-size: 25px;
    line-height: 33px;
    border-radius: 5px;
  }

  @include vp-mobile {
    padding: 13px 14px 9px;
    font-size: 14px;
    line-height: 16px;
  }

  &:hover {
    background-color: $color-cornsilk;
  }

  &[disabled] {
    border-color: $color-bright-gray;
    color: $color-silver-sand-c6;
    background-color: $color-cultured-f6;
    cursor: unset;
  }
}

.news {
  width: 100%;
  display: flex;
  flex-direction: column;
  align-items: start;
  gap: 50px;

  @include vp-laptop {
    gap: 40px;
  }

  @include vp-tablet {
    gap: 30px;
  }

  @include vp-mobile {
    gap: 20px;
  }

  &__top {
    display: flex;
    width: 100%;
    align-items: center;
    justify-content: space-between;
    margin: 0 0 10px;
  }

  &__title {
    font-family: $ff-gilroy, sans-serif;
    color: $color-black;
    font-weight: 900;
    font-size: 40px;
    line-height: 50px;
    width: fit-content;
    margin: 0;
    padding: 0;

    @include vp-laptop {
      font-size: 28px;
      line-height: 35px;
    }

    @include vp-tablet {
      font-size: 36px;
      line-height: 45px;
    }  
    
    @include vp-mobile {
      font-size: 18px;
      line-height: 22px;
    }           
  }

  &__toggle {
    width: calc(100% - 280px);
  }

  &__list {
    width: 100%;
    display: flex;
    flex-direction: column;
    margin: 0;
    padding: 0;
    list-style-type: none;
    gap: 30px;

    @include vp-laptop {
      gap: 20px;
    }

    @include vp-tablet {
      gap: 20px;
    }

    @include vp-mobile {
      gap: 10px;
    }
  }

  &__item {
    padding: 0;
    margin: 0;
    width: 100%;
  }

  &__button {
    width: 100%;
  }
}
</style>
